[{"id":76,"title":"Jobs at Flutterwave","description":"Our mission is to power a new wave of prosperity across Africa. By enabling global digital payments on a continent that&rsquo;s been largely cut off from the digital economy, we&rsquo;re creating the infrastructure to power Africa&rsquo;s growth in the 21st Century.\n\nFounded in 2016 by a team of ex-bankers, entrepreneurs and engineers, we provide the underlying technology platform that allows businesses to make and accept payments anywhere in Africa. Our HQ is in San Francisco with offices in Lagos, Nairobi, Accra, and Johannesburg","link":"https:\/\/www.myjobmag.com\/jobs\/jobs-at-flutterwave-3","pub_date":"Mon, 23 Jan 2023 14:27:38 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":77,"title":"Laboratory Assistant at Sinoma Cargo International Nigeria Limited","description":"SINOMA CARGO INTERNATIONAL NIGERIA LTD. is wholly owned subsidiary invested by Sinoma Cargo in Nigeria, founded in June 2016, located in Nigeria,Lagos. Sinoma Cargo is the first branch set up in West Africa in the process of implementing globalization strategy. Currently, Sinoma Cargo has obtained the clearance qualification and provides overseas warehousing and distribution services,equipped with 40 normal trailers and 10 tow-beds,Sinoma Cargo Nigeria can deliver general cargoes,heavy lifts, over-sized goods and self-owned custom house broker has been set up as well. There are 12 Chinese employees and 100 native employees at present.","link":"https:\/\/www.myjobmag.com\/jobs\/laboratory-assistant-at-sinoma-cargo-international-nigeria-limited","pub_date":"Mon, 23 Jan 2023 14:27:15 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":78,"title":"Accountant at Mabey Solicitors","description":"","link":"https:\/\/www.myjobmag.com\/jobs\/accountant-at-mabey-solicitors","pub_date":"Mon, 23 Jan 2023 14:23:36 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":79,"title":"Project Coordinator at Innovations for Poverty Action","description":"Innovations for Poverty Action (IPA) is a research and policy nonprofit that discovers and promotes effective solutions to global poverty problems. IPA brings together researchers and decision-makers to design, rigorously evaluate, and refine these solutions and their applications, ensuring that the evidence created is used to improve the lives of the world&rsquo;s poor.","link":"https:\/\/www.myjobmag.com\/jobs\/project-coordinator-at-innovations-for-poverty-action","pub_date":"Mon, 23 Jan 2023 14:22:59 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":80,"title":"Job Vacancies at First Bank","description":"First Bank of Nigeria Limited (FirstBank) is Nigeria&rsquo;s largest financial services institution by total assets and gross earnings. With more than 10 million customer accounts, FirstBank has over 750 branches providing a comprehensive range of retail and corporate financial services. The Bank has international presence through its subsidiaries, FBN Bank (UK) Limited in London and Paris, FBNBank DRC, FBNBank Ghana, FBNBank Gambia, FBNBank Guinea, FBNBank Sierra-Leone and FBNBank Senegal, as well as its Representative Offices in Johannesburg, Beijing and Abu Dhabi.\n\nSince its establishment in 1894, FirstBank has consistently built relationships with customers focusing on the fundamentals of good corporate governance, strong liquidity, risk management and leadership. Over the years, the Bank has led the financing of private investment in infrastructure development in the Nigerian economy by playing key roles in the Federal Government&rsquo;s privatisation and commercialisation schemes. With its global reach, FirstBank provides prospective investors wishing to explore the vast business opportunities that are available in Nigeria, an internationally competitive world-class brand and a credible financial partner. \n\nThe Bank has been named \"The Best Bank Brand in Nigeria&rdquo; four times in a row - 2011, 2012, 2013, 2014 - by the globally renowned \"The Banker Magazine&rdquo; of the Financial Times Group; and \"Most Innovative Bank in Africa&rdquo; in the EMEA Finance African Banking Awards 2014. FirstBank&rsquo;s brand purpose is to always put its customers, partners and all stakeholders at the heart of its business, even as it is poised to standardise customer experience and excellence in financial solutions across Sub Saharan Africa, in consonance with its brand vision \"To be the partner of first choice in building your future&rdquo;. Our brand promise is to always deliver the ultimate \"gold standard&rdquo; of value and excellence. This commitment is anchored on FirstBank&rsquo;s inherent values of passion, partnership and people, to position our customers first in every respect.","link":"https:\/\/www.myjobmag.com\/jobs\/job-vacancies-at-first-bank","pub_date":"Mon, 23 Jan 2023 14:17:43 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":81,"title":"Customer Relationship Manager at Reposebay Human Resources Limited","description":"Reposebay is a boutique recruitment company serving both micro employers and SMEs with customized solutions and human capital growth strategies. Her career advisory specialty services have impacted over 3000+ job seekers.","link":"https:\/\/www.myjobmag.com\/jobs\/customer-relationship-manager-at-reposebay-human-resources-limited","pub_date":"Mon, 23 Jan 2023 14:17:13 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":82,"title":"Company Truck Driver at Morning Star Ceramics","description":"MorningStar Ceramics is a sales company involved in the sales, supply and distribution of various building materials.","link":"https:\/\/www.myjobmag.com\/jobs\/company-truck-driver-at-morning-star-ceramics","pub_date":"Mon, 23 Jan 2023 14:13:09 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":83,"title":"Relationship \/ Loan \/ Credit Officer at Crossover Microfinance Bank","description":"Crossover Microfinance bank Ltd was first incorporated under the name Pacific Savings and Loans Ltd in 1992. With a new focus and team in 2010 the bank was later rebranded Crossover Savings and Loans Ltd aka Crossover Mortgage Bankers. With the ever growing financial need in the retail sector and with new investors, Crossover downscaled it operations from mortgage to microfinance in 2014 to empower micro and small scale businesses in the retail sector. It commenced full scale microfinance operations in March 2016. Crossover Microfinance Bank Ltd is duly licensed by the Central Bank of Nigeria (CBN) and certified by NDIC with a paid up capital of N450 million.","link":"https:\/\/www.myjobmag.com\/jobs\/relationship-loan-credit-officer-at-crossover-microfinance-bank","pub_date":"Mon, 23 Jan 2023 14:10:17 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":84,"title":"Sales Executives at JMG Limited","description":"For over 15 years, JMG has been asserting its excellence as a leader in the power generation industry. Our strong partnership with FG Wilson, a trademark under the recognized Caterpillar Inc. brand portfolio and the world&rsquo;s front-runner manufacturer of Perkins generators has given us the foundation to steer the industry in the direction of quality, support and innovation to become today the world&rsquo;s largest FG Wilson dealer.\n\nFollowing our success in the retail market and to support the privatization of the Power Sector in Nigeria, JMG has been appointed by Mitsubishi Heavy Industries as a partner for Sales and Services. This partnership enhances JMG&rsquo;s capabilities to offer premium solutions in power plants, cogeneration, independent power projects and gas turbines technologies.\n\nIn 2014, we have partnered with Legrand, a global specialists in analogue and digital electrical fixtures and fittings enabling us to distribute high quality low-voltage products and deliver end-to-end power solutions to all our customers.\n\nJMG&rsquo;s facilities span over a combined area of 35,000 m2 and host a staff force exceeding 1700 highly skilled and experienced individuals. We are deeply committed to offer our clients exceptional quality products and services. This is why we only represent superior global brands that offer unsurpassed performance. We are the only company in the country that has resident FG Wilson engineers and quality managers as part of its workforce. Their presence not only assures our customers with premier performance, but also provides our staff with the universal training needed for professional sales and after-sales support.\n\nQuality cannot be guaranteed unless users are comforted with remarkable technical support. JMG&rsquo;s continuous investments in facilities, equipment, training programs and skilled personnel promise its clients with world-class services and prompt cooperation. We have set up over 20 technical service centers that operate round the clock. With our dedicated 24\/7 help desk and over 100 fully equipped engineering teams spread out across Nigeria, we rapidly reach out to all our clients&rsquo; requests.","link":"https:\/\/www.myjobmag.com\/jobs\/sales-executives-at-jmg-limited-1","pub_date":"Mon, 23 Jan 2023 14:07:12 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":85,"title":"Restaurant Supervisor at Broadway Cafeteria","description":"Broadway Cafeteria is a restaurant located in Lagos State.","link":"https:\/\/www.myjobmag.com\/jobs\/restaurant-supervisor-at-broadway-cafeteria","pub_date":"Mon, 23 Jan 2023 14:03:01 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":86,"title":"Job Vacancies at UnoCasa Limited","description":"UnoCasa Limited was incorporated in 2009 to provide companies with business solutions in Marketing, Business Strategy , Recruitment and general Human Resources consultancy.","link":"https:\/\/www.myjobmag.com\/jobs\/job-vacancies-at-unocasa-limited-2","pub_date":"Mon, 23 Jan 2023 13:43:10 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":87,"title":"Maintenance Manager at Airswift","description":"AirSWIFT (formerly ITI Air) is a Filipino-owned regional airline company with a permit to operate domestic scheduled and non-scheduled air transportation services. The company operates a private airport at El Nido, Palawan (El Nido Airport) and serves the aircraft transportation requirements of its affiliated company, El Nido Resorts, as well as operating on behalf of third-parties.","link":"https:\/\/www.myjobmag.com\/jobs\/maintenance-manager-at-airswift","pub_date":"Mon, 23 Jan 2023 13:39:17 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":88,"title":"Call Center Operator(Sales) at Vitalvida","description":"We provide you with an excellent eCommerce experience as our clients satisfaction matters a lot to us. We have an amazing combination of Products on our various websites that are tailored to meet your needs.","link":"https:\/\/www.myjobmag.com\/jobs\/vitalvida-sales-call-center-operator-at-vitalvida","pub_date":"Mon, 23 Jan 2023 13:38:25 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":89,"title":"SAP Business One Consultant at Ascentech Services Ltd","description":"Ascentech Services Ltd acts as a gateway to provide a wide range of recruitment and selection services to companies. We are a dedicated team of professional consultants offering top-of-the-line executive recruitment and selection services. We cater for the needs of a range of professionals seeking employment and work together to create effective solutions using our networks and strong client base.","link":"https:\/\/www.myjobmag.com\/jobs\/sap-business-one-consultant-at-ascentech-services-ltd","pub_date":"Mon, 23 Jan 2023 13:36:26 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":90,"title":"Social Media and Content Development Executive at Lendha","description":"Get Quick Access To Loans To Pay House Rent,\nFinance Lifestyle Or Emergency At A Low Rate.\n\nUp To N 3,000,000 | No Paper Work","link":"https:\/\/www.myjobmag.com\/jobs\/social-media-and-content-development-executive-at-lendha","pub_date":"Mon, 23 Jan 2023 13:35:55 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":91,"title":"Digital Service Executive at George Houston Resources Limited","description":"George Houston Resources Limited (GHR) assists organizations to achieve their corporate visions and objectives through integrated, strategic and solution-oriented HR consulting services using best-practice methodologies.\n","link":"https:\/\/www.myjobmag.com\/jobs\/digital-service-executive-at-george-houston-resources-limited","pub_date":"Mon, 23 Jan 2023 13:29:12 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":92,"title":"Technical Support Engineer \/ Technical Associate Engineer at Zkteco Biometric Limited","description":"ZKTeco is a world-leading manufacturer of biometrics readers (facial, vein, fingerprint palm) access controls, time attendance, turnstiles and barriers, security cameras, metal detectors, car park & vehicle management solutions, X-Ray inspection, integrated security solutions, and embedded biometric and radio-frequency identification modules.","link":"https:\/\/www.myjobmag.com\/jobs\/technical-support-engineer-technical-associate-engineer-at-zkteco-biometric-limited","pub_date":"Mon, 23 Jan 2023 13:28:06 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":93,"title":"Cashier at SKLD Integrated Services Limited","description":"SKLD integrated Services LLC is Nigeria&rsquo;s leading provider of relief products and solutions to local and international organizations engaged in development work, emergency interventions and crisis management. SKLD was formerly operating under the name School Kits Limited, an integrated educational supplies company which was launched in 2000 in Lagos, Nigeria.","link":"https:\/\/www.myjobmag.com\/jobs\/cashier-at-skld-integrated-services-limited","pub_date":"Mon, 23 Jan 2023 13:27:22 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":94,"title":"Account Officer at Lorache Consulting","description":"LORACHE LIMITED is a marketing management, Human Capital development and Business Process &amp; Strategist consultancy outfit, registered with Company &amp; Allied Commission (CAC) of Nigeria to perform such businesses.\n\nLORACHE deals in sales and marketing consultancy and training organisation working across multiple industries, including the consumer goods, finance, capital market, pharmaceutical, telecommunication, entertainment and leisure sectors etc. We develop integrated sales and marketing strategies focused around the point of purchase. We also devise transformational strategies through organisation design, process definition, and commercial ability development.\nLORACHE provides a range of open and dedicated training programmes that gives insight and help clients develop and maintain the flow of integrated information and commercial insights to gain competitive advantage.","link":"https:\/\/www.myjobmag.com\/jobs\/account-officer-at-lorache-consulting-4","pub_date":"Mon, 23 Jan 2023 13:26:04 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":95,"title":"Internal Auditor at Olakleen Holdings Limited","description":"O'la-kleen Nigeria Limited is Nigeria's foremost cleaning service company with a brand name used as a reference point both locally and internationally.\nThe company has continued to exceed the expectations of clients thereby defining service excellence in the cleaning industry.\n\nOur services includes:\n\n    Janitorial Cleaning Services\n    Cleaning of Aircrafts\n    Hospital and Hotels Cleaning\n    Window &amp; Curtain Wall Cleaning\n    Wall Washing\n    Acoustic Cleaning\n    Pressure Cleaning\n    Blinds Cleaning\n    Degreasing\n    Pest Control\n    Honing\/Restoration of Marble &amp; Granite floor\n    Steam Cleaning of Carpets and Upholstery\n    Burnishing of floor {Terrazzo, Palladian, Parquet}\n    Initial cleaning of new and renovated building, etc \n\nO'la-kleen Nigeria Limited renders services for the corporate organisation as well as individuals with our clients list ranging from the American Embassy, Central Bank of Nigeria and Nigerian Breweries to mention but a few.","link":"https:\/\/www.myjobmag.com\/jobs\/internal-auditor-at-olakleen-holdings-limited-1","pub_date":"Mon, 23 Jan 2023 13:24:01 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":96,"title":"Head of Business Development\/Client Service at LEAD Enterprise Support Company Limited","description":"LEAD Enterprise Support Company Limited is a foremost Human Resources Solutions organization with many years of cumulative experience and expertise. We are prolific in Outsourcing, Recruitment, Head hunting and HR Advisory. We are a multi-sectorial servicing company, with landmark service deliverables to our clients in varied industries.","link":"https:\/\/www.myjobmag.com\/jobs\/head-of-business-development-client-service-at-lead-enterprise-support-company-limited","pub_date":"Mon, 23 Jan 2023 13:22:57 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":97,"title":"Job Openings at Zaika Foods Limited","description":"Zaika Foods offers customized and proprietary solutions for Spices, Seasonings, Marinades & Sauces, Breading & Batter and Meat Solutions for the foodservice and food processing industries.","link":"https:\/\/www.myjobmag.com\/jobs\/job-openings-at-zaika-foods-limited","pub_date":"Mon, 23 Jan 2023 13:21:53 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":98,"title":"Utilities Engineer at International Breweries","description":"International Breweries Plc was incorporated in December 1971 by its founder and first Chairman, Dr. Lawrence Omole under the name International Breweries Limited. The Company commenced production of its flagship product Trophy Lager in December 1978 with an installed capacity of 200,000 hectoliters per annum.\n\nFollowing the increasing demand for its products, in December 1982 the Company embarked on an expansion programme to increase its capacity to 500,000 hectoliters annually. The company was listed on the floor of the Nigerian Stock Exchange in April 1995.","link":"https:\/\/www.myjobmag.com\/jobs\/utilities-engineer-at-international-breweries-1","pub_date":"Mon, 23 Jan 2023 13:21:35 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":99,"title":"Sales Managers at De-Orange Technologies Services","description":"De-Orange Technologies Services is a global information communication Technology solutions and service provider. It was incorporate 2016, to carry out the latest ICT and it best in international standard.\n\nDe-Orange Technologies Services provide the equipment Technologies foundation for some of the largest service provider, commercial business and enterprises customers in the world including corporation, government agencies, utilities and educational institutions.","link":"https:\/\/www.myjobmag.com\/jobs\/sales-managers-at-de-orange-technologies-services","pub_date":"Mon, 23 Jan 2023 13:21:12 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":100,"title":"Business Development Manager \/ Sales Manager at 4 Quarters Consulting","description":"We are widely valued for providing our clients with ISO Consultancy Services. Rendered by diligent professionals, these offered services are appreciated for their time-execution, reliability and authenticity. During the dealings, we assure that all the rules and regulations are followed as per the International norms.","link":"https:\/\/www.myjobmag.com\/jobs\/business-development-manager-sales-manager-at-4-quarters-consulting","pub_date":"Mon, 23 Jan 2023 13:17:00 GMT","is_publish":1,"created_at":"2023-01-23T21:59:37.000000Z","updated_at":"2023-01-23T21:59:37.000000Z","deleted_at":null},{"id":1,"title":"Job Openings at Lheon Consulting","description":"Lheon Consulting Limited is a strategy talent development consultancy company devoted exclusively to micro-financing and career development activities.","link":"https:\/\/www.myjobmag.com\/jobs\/job-openings-at-lheon-consulting","pub_date":"Mon, 23 Jan 2023 21:24:49 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":2,"title":"Job Vacancies at Talents360.ng","description":"","link":"https:\/\/www.myjobmag.com\/jobs\/job-vacancies-at-talents360-ng","pub_date":"Mon, 23 Jan 2023 21:12:07 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":3,"title":"Front Desk Officer at Inagbe Grand Resort and Leisure","description":"An island resort that offers more than just sun, sand, and sea! A resort full of surprises, fun activities, lively entertainment, and smiling faces that are sure to give your holiday so much more.","link":"https:\/\/www.myjobmag.com\/jobs\/front-desk-officer-at-inagbe-grand-resort-and-leisure","pub_date":"Mon, 23 Jan 2023 20:32:55 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":4,"title":"IP Network Engineer at Ntel Nigeria","description":"Ntel is Nigeria&rsquo;s most revolutionary telecommunications company which provides 4G LTE Advanced network that delivers superfast call-connect times, crystal clear Voice over LTE and extraordinarily high internet access speed (up to 230Mbps).\n\nOur aim is to redefine the Nigerian telecommunications landscape and enrich the lives of Nigerians by delivering the most advanced communications technology across the largest possible network coverage in the most effective, valuable and satisfying manner.\n\nWe firmly believe that by delivering superb and unparalleled broadband-based mobile services, we can help individuals and enterprises harness the power of connectivity and maximise their potentials.\n\nThis belief is pursued and sustained by anchoring our activities on the fundamental LIVE principle- leadership, innovation, value and experience.","link":"https:\/\/www.myjobmag.com\/jobs\/ip-network-engineer-at-ntel-nigeria","pub_date":"Mon, 23 Jan 2023 20:30:07 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":5,"title":"Business Development Manager at Reime West Africa Limited","description":"Reime West Africa Limited is a fully owned subsidiary of a global brand with head office at Casablanca in Morocco that provides Telecom Infrastructure Development and Maintenance Services to Telecom companies in Nigeria.","link":"https:\/\/www.myjobmag.com\/jobs\/business-development-manager-at-reime-west-africa-limited","pub_date":"Mon, 23 Jan 2023 20:22:55 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":6,"title":"Business Writer (Currency) at AllNews Nigeria","description":"AllNews Nigeria is a news organization created to educate, inform and entertain people while ensuring that we provide accurate news with more comprehensive analysis of events around the world.","link":"https:\/\/www.myjobmag.com\/jobs\/business-writer-currency-at-allnews-nigeria","pub_date":"Mon, 23 Jan 2023 20:20:37 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":7,"title":"IT Student \/ Corps Member at Attainables Edutainment Limited","description":"Attainables is an educating and entertaining company which was created to complement school learning by communicating sound educational, religious values and character building principles into children and families through fun learning resources (DVDS, CDs, Science kits, quality tablets and several other activities that are family friendly, educational, ethical  and fun orientated.\n\nWe are acutely aware of the type of children&rsquo;s products that currently exists, and was eager to introduce a series that would help teach education, principles through fun learning to children that parents can trust.\n\nCurrently, Attainables distribute products learning resources from - RocknLearn, Leapfrog, Brainetics, Laser pegs, Patchproducts, Thames &amp; Kosmos-Science kits, Tommy Nelson, Cedarmont kids, Praise baby, Sesame Street, Hermie&amp;friends, Paws&amp;Tales, and a wide range of collections which cover topics several segments: Preschool, Language Arts, Math, Phonics, Sciences, Current Affairs from a broad curriculum(British ,American, African etc.) to equip children in the African market space to become a global player.\n\nOur Entertaining Offerings are aimed at building Integrity, strength of character, discipline and godly values in our children which is fast eroding our society.","link":"https:\/\/www.myjobmag.com\/jobs\/it-student-corps-member-at-attainables-edutainment-limited","pub_date":"Mon, 23 Jan 2023 20:17:26 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":8,"title":"Office Assistant at Osibogun and Partners","description":"Osibogun and Partners is a legal practice that helps individuals, corporations, financial institutions, and governmental entities across the spectrum of their critical business and legal issues globally and locally. We strive to provide an approach to service that is aligned with the concerns and priorities of our clients, and to deliver exceptional value and support throughout our relationships with our clients. To ensure we meet these standards we define formally within our firm values that we believe must be the basis for our attitudes and behavior at all times. These values form an important part of our regular performance appraisal of our lawyers.","link":"https:\/\/www.myjobmag.com\/jobs\/office-assistant-at-osibogun-and-partners","pub_date":"Mon, 23 Jan 2023 20:14:41 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":9,"title":"Accounting Intern at Basscomm Group Limited","description":"BASSCOMM is a Mechanical and Electrical Contractor working throughout Nigeria with a reputation for completing projects efficiently, within time and budget constraints and to the highest quality it has made us the Contractor of choice for our industry over the past decade. We currently operate across Nigeria in various sectors throughout the industry.","link":"https:\/\/www.myjobmag.com\/jobs\/accounting-intern-at-basscomm-group-limited","pub_date":"Mon, 23 Jan 2023 20:08:37 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":10,"title":"Junior Accountant at Pistachio Associates","description":"Pistachio Associates is an all round Business Development Services Provider offering Business Acceleration, Outsourced Financial Services and Technology Solutions to the Start ups, Small and Medium Enterprises (SSME&rsquo;S). Our company&rsquo;s unique focus has made available, world class services to businesses existing at every stage of development accross industries. We aim to support SSME&rsquo;s towards growth in both the top and bottom lines of their business performance and to ensure efficiency and effectiveness in allocation of resources.","link":"https:\/\/www.myjobmag.com\/jobs\/junior-accountant-at-pistachio-associates","pub_date":"Mon, 23 Jan 2023 20:06:04 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":11,"title":"Production Supervisor  at Vixa Pharmacy","description":"","link":"https:\/\/www.myjobmag.com\/jobs\/production-supervisor-at-vixa-pharmacy","pub_date":"Mon, 23 Jan 2023 20:02:44 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":12,"title":"Buyer at QMBMart Limited","description":"QMB BUILDERS' MART LIMITED was established in 2006 as a building materials' one-stop-shop for buy-it-your-self Developers, Builders, Professionals and Individual home improvements customers in the Nigerian property market.\n\nThe dream of its founders is to, through multiple outlets, provide credible and sustainable alternative conducive environments,  quality products and customer oriented services to the building materials market in Nigeria.\n\nQMB prides its self with high quality products, comparative prices and excellent customer services by our team of well trained and talented staffs who knowledgeably guide customers through products selection processes, products features, applications and maintenance. We also provide Warehousing facilities, delivery and project procurement planning advisory and implementations services.","link":"https:\/\/www.myjobmag.com\/jobs\/buyer-at-qmbmart-limited","pub_date":"Mon, 23 Jan 2023 19:59:24 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":13,"title":"Female Social Media Manager at Hazon Holdings","description":"Hazon Holdings is a continually growing and leading conglomerate domiciled in Africa. We specialize in raising standards through our synergy of diverse business units. We are core believers in driving people, processes and businesses to attain peak productivity in given fields through steadfastness and ultimate discipline.\n\nOur vision though behemoth, is driven by a hallmark of organizations forecasting on landmark changes in business sectors, positioning itself to exploit opportunities of raising the standard of living in Nigeria through job creation and skill development.\n\nWe procure and provide workable business solutions ranging from advertising, insurance, commodity trading and investment to consumers, corporations and institutions to everyday challenges by constantly sourcing and creating new unique ways of delivering satisfactory services to our clients.","link":"https:\/\/www.myjobmag.com\/jobs\/female-social-media-manager-at-hazon-holdings","pub_date":"Mon, 23 Jan 2023 19:53:28 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":14,"title":"Latest Jobs at Uleval Technology","description":"We are Uleval Technology-an award-winning company building tailor-made web applications, web tools, and premium websites aligned with business needs, customer&rsquo;s problems, your market, and essentially-your budget.","link":"https:\/\/www.myjobmag.com\/jobs\/latest-jobs-at-uleval-technology","pub_date":"Mon, 23 Jan 2023 19:50:09 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":15,"title":"Dispatch Rider at Dreams Placement Hub","description":"Dreams Placement Hub is a recruitment and placement agency that finds the best suited skilled, semi-skilled and unskilled candidates for temporary or and permanent opportunities in both the formal and informal sectors.","link":"https:\/\/www.myjobmag.com\/jobs\/dispatch-rider-at-dreams-placement-hub-2","pub_date":"Mon, 23 Jan 2023 19:46:07 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":16,"title":"Dispatch Rider at Ntisa Limited","description":"Ntisa Limited is a cloud technology company that provides business owners with software solutions to help them innovate and eliminate inefficiencies to become more profitable. ","link":"https:\/\/www.myjobmag.com\/jobs\/dispatch-rider-at-ntisa-limited","pub_date":"Mon, 23 Jan 2023 19:43:14 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":17,"title":"Personal Assistant at Oyinscents & More","description":"Oyinscents & More deals with the sales and supplies of perfumes, scents, beauty accessories, wholesale and retail of general goods.","link":"https:\/\/www.myjobmag.com\/jobs\/personal-assistant-at-oyinscents-more","pub_date":"Mon, 23 Jan 2023 19:36:15 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":18,"title":"Job Vacancies at Virgin Beauty industries Limited","description":"Virgin Beauty industries Limited, is a leading company in the beauty industry in Nigeria. We offer exceptional products for hair and skin solutions. Our goal is to meet customers beauty needs and keep their hair nourished with our organically sourced materials.","link":"https:\/\/www.myjobmag.com\/jobs\/sales-representative-at-virgin-beauty-industries-limited-2","pub_date":"Mon, 23 Jan 2023 18:56:55 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":19,"title":"Quantity Surveying Intern at Uraga Real Estate","description":"Over the last 10 years Uraga Real Estate (A Honeywell Group Company) has created and reinvented some of the most recognizable buildings in Nigeria.\n\nWe have delivered over 39 thousand square meters and 38.7 million dollars worth of end value development\n\nIn all developments, we transform communities by bringing our expertise in land acquisition, design, planning and execution to provide unique lifestyle offerings to a range of clients, across industries including residential, hospitality, leisure & commercial industries.","link":"https:\/\/www.myjobmag.com\/jobs\/quantity-surveying-intern-at-uraga-real-estate","pub_date":"Mon, 23 Jan 2023 18:53:13 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":20,"title":"Administrative Officer at Primero Transport Service Limited","description":"PRIMERO Transport Services Limited was launched on the 12th of November, 2015 by His Excellency Mr. Akinwumi 'Dapo Ambode, the Executive Governor of Lagos State at Majidun depot. Its&Acirc;&nbsp;full operation commenced on 13th November 2015. The operation commenced on our approved routes with 434 Youtong high-capacity buses. Major terminals are located at Ikorodu, Agric, and Mile12, BRT lane extension from Ikorodu to Mile12.","link":"https:\/\/www.myjobmag.com\/jobs\/administrative-officer-at-primero-transport-service-limited","pub_date":"Mon, 23 Jan 2023 18:50:19 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":21,"title":"Account Officer at Bilaad Realty Limited","description":"We are a 100% private owned company comprising of an impressionable number of professionals whose main goal is to turn dream properties into sustainable and achievable reality as well as ensuring prone to flourish investment solutions that are not just luxurious but are affordable, attainable and future secure.","link":"https:\/\/www.myjobmag.com\/jobs\/account-officer-at-bilaad-realty-limited","pub_date":"Mon, 23 Jan 2023 18:41:41 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":22,"title":"HR \/ Administrative Manager at HRbreakoutRoom","description":"We help our clients win in the marketplace by providing state-of-the-art HR services.\n","link":"https:\/\/www.myjobmag.com\/jobs\/hr-administrative-manager-at-hrbreakoutroom","pub_date":"Mon, 23 Jan 2023 18:39:08 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":23,"title":"Sales Executive at Churchgate Group","description":"The Churchgate Group has become one of the largest and most successful conglomerates in the industrial, trading and building sectors of Nigeria and has earned a national reputation for its standards of quality. Since its inception, the privately held company has been one of the largest employers in Nigeria in a variety of business sectors and is regarded as a trusted \"household&rdquo; name.\n\nBuilding on core strengths, goodwill and expertise, The Group has made considerable inroads into the real estate, banking and financial sectors. Currently, The Group is investing in hospitality, residential and commercial real estate and is regarded as a premier and quality developer in Nigeria.\n\nWe have also acquired core investor positions in two leading Nigerian banks and have a team of financial experts who manage and invest our own proprietary funds. We will continue to build on this foundation and view it as the beginning of an exciting journey with our efforts focused on key drivers in an emerging economy.","link":"https:\/\/www.myjobmag.com\/jobs\/sales-executive-at-churchgate-group","pub_date":"Mon, 23 Jan 2023 18:35:34 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":24,"title":"General Manager (Logistics and Supply Chain) at Makarios Consulting Services","description":"Your partner for people and process optimisation.","link":"https:\/\/www.myjobmag.com\/jobs\/general-manager-logistics-and-supply-chain-at-makarios-consulting-services","pub_date":"Mon, 23 Jan 2023 18:32:52 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":25,"title":"Consultant at Centre for Law and Socio Economic Development (CLED)","description":"Center for Local Economic Development (CLED) is a non-commercial and non-political organization established in February, 2003. CLED is eager to achieve maintaining and strengthening active civil society control over socio-economic processes and developing effective civil initiatives related to maintaining sustainable development in the country.\n\nThe goal of the CLED team was creating a nationally and regionally recognized \"think-tank&rdquo; in the field socio-economic policy analysis. Thus CLED has taken up a very fundamental and crucial mission.","link":"https:\/\/www.myjobmag.com\/jobs\/consultant-at-centre-for-law-and-socio-economic-development-cled","pub_date":"Mon, 23 Jan 2023 18:30:09 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":26,"title":"Senior Finance Officer at BainesCredit Microfinance Bank","description":"BainesCredit Microfinance Bank, a financial institution committed to solving all the financial needs of salary earners, micro, small, and medium scale enterprises, and other corporate sectors through an empathic and innovative process.","link":"https:\/\/www.myjobmag.com\/jobs\/senior-finance-officer-at-bainescredit-microfinance-bank","pub_date":"Mon, 23 Jan 2023 18:24:15 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":27,"title":"Internal Control Officer at Mosra Enerji Limited","description":"Mosra Enerji Limited (formally known as Dalkiranlar Enerji Limited) has been a market leader in energy transmission and distribution in Nigeria since 2010. In our few years of operations, we have expanded our capacity to undertake and deliver projects in Nigeria and other parts of Africa utilising our local strengths.\n\nWe employ energy professionals who have worked with both private and public sector power\/energy companies . We understand the technical and commercial demands facing the global energy market - increasing regulatory scrutiny, volatility in price and demand, and a growing demand for alternative energy sources. We bring this industry insight to bear in our technical service delivery.","link":"https:\/\/www.myjobmag.com\/jobs\/internal-control-officer-at-mosra-enerji-limited-1","pub_date":"Mon, 23 Jan 2023 17:56:46 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":28,"title":"Field Sales Representative at Decapolis Limited","description":"The Decapolis Group, a limited liability company was established in Nigeria in 2002. A young and growing organisation the company is steadily growing representing international and multinational companies in the region.\n\nHaving worked together for many years, we decided to combine our strengths and competencies into an idea that would offer products and services to our customers on a whole new level.","link":"https:\/\/www.myjobmag.com\/jobs\/field-sales-representative-at-decapolis-limited","pub_date":"Mon, 23 Jan 2023 17:51:59 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":29,"title":"Parts Warehouse Supervisor at Perfection Motor Company Limited","description":"Perfection Motors a subsidiary of the Lee Group of companies was established in partnership with FAW China. Perfection Motor&rsquo;s was given the sole rights to, assemble and market FAW heavy duty Trucks in Nigeria. Since our inception in 2013 we have made great strides in insuring that we will be ready to service our market by establishing our head office alongside a fully equipped workshop, Parts Department and not to mention an SKD assembly plant in Ikeja.","link":"https:\/\/www.myjobmag.com\/jobs\/parts-warehouse-supervisor-at-perfection-motor-company-limited","pub_date":"Mon, 23 Jan 2023 17:44:32 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":30,"title":"Job Opportunities at KNN Corporate Services Limited","description":"KNN Corporate Services Limited is a dynamic group of professionals with more than three decades of combined experience in supporting businesses, providing corporate governance, HR consulting and company secretarial services. We are young, energetic, and highly proficient in our various fields, and also enjoy serving you - our client.","link":"https:\/\/www.myjobmag.com\/jobs\/intermediate-php-yii-2-backend-developer-at-knn-corporate-services-limited","pub_date":"Mon, 23 Jan 2023 17:41:13 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":31,"title":"Supply Officer atEden Solutions and Resources","description":"Eden Solutions &amp; Resources Ltd is a human resource management company that provides its client with best practice business management solutions.\n\nRegistered in 2002 in Nigeria, and managed by a competent team of professionals. Eden Solutions &amp; Resources was initially set up, primarily as a recruitment agency but today it has evolved into company offering a full complement of business management &amp; HR services including recruitment, training and staff management.\n\nWe do not just offer staff recruitment services; we offer solutions. Our staffing solutions are structured to improve the bottom line. Thus whenever an employer requests for our services, we evaluate the client&rsquo;s business to develop the appropriate staffing solution that is suitable for that business.\n\nWe have had the privilege of helping some of the finest organizations in Nigeria, such as NECO, Minna; Sure-foot America International School Calabar; Celtel Communications Ltd (now Zain ltd) Abuja; First Monument Bank (FCMB) Lagos, Atlas Copco Ltd, Abuja; Construction Kaiser, Abuja and many more. Why do such prestigious organizations engage us? Because! Quite frankly, we produce for them.\n\nWhat is unique about services? Unlike others in our field we do not see job seekers as sources of income; neither do we believe in exploiting them. This is why we do not accept or demand fees from job seekers to secure them jobs. We only facilitate the process.\n\nThis is partly the reason for our motivation to partner with organizations such as yours to address the unemployment situation. For more details on this please contact us. We would be delighted to demonstrate to you how we can improve the staffing or organization situation in your company.","link":"https:\/\/www.myjobmag.com\/jobs\/supply-officer-ateden-solutions-and-resources","pub_date":"Mon, 23 Jan 2023 17:36:25 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":32,"title":"Jobs at Efficacy Construction Company","description":"Efficacy Homes Limited was incorporated as a limited liability company with RC 765581 in August 2008 to carryout professional and corporate business in Real Estate, Building Construction and Project management. It has her office at idowu taylor, Victoria Island. Lagos.\n\nSince inception, Efficacy homes limited has engaged competent professionals in developing Estates and building homes.","link":"https:\/\/www.myjobmag.com\/jobs\/tender-and-bid-officer-at-efficacy-construction-company","pub_date":"Mon, 23 Jan 2023 17:26:53 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":33,"title":"Accounts Officer at WELLSPRING college","description":"WELLSPRING COLLEGE is a model school established by astute and seasoned academics and educational administrators who commonly share the vision of returning standards to the nation&rsquo;s educational system. The founders of Wellspring College are impassioned with the desire to restore light to the somewhat dark current tunnel of Nigerian education.\nBy harnessing every opportunity to give our students sound spiritual, academic, mental and social, development, we provide the Biblical framework which lends validity to material success in life\nOur Mission\nOur vision consist of the following goals:\nTo demonstrate that it is a function of a school to produce high educational standards and sound moral disposition in young boys and girls.\nTo lay a solid foundation in the youth for that righteousness and integrity of personality make-up which will exalt our great nation.\nTo produce a total child, i.e., a child that is sound spiritually, academically, physically and emotionally.","link":"https:\/\/www.myjobmag.com\/jobs\/accounts-officer-at-wellspring-college-1","pub_date":"Mon, 23 Jan 2023 16:55:05 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":34,"title":"Accounts Officer at WELLSPRING college","description":"WELLSPRING COLLEGE is a model school established by astute and seasoned academics and educational administrators who commonly share the vision of returning standards to the nation&rsquo;s educational system. The founders of Wellspring College are impassioned with the desire to restore light to the somewhat dark current tunnel of Nigerian education.\nBy harnessing every opportunity to give our students sound spiritual, academic, mental and social, development, we provide the Biblical framework which lends validity to material success in life\nOur Mission\nOur vision consist of the following goals:\nTo demonstrate that it is a function of a school to produce high educational standards and sound moral disposition in young boys and girls.\nTo lay a solid foundation in the youth for that righteousness and integrity of personality make-up which will exalt our great nation.\nTo produce a total child, i.e., a child that is sound spiritually, academically, physically and emotionally.","link":"https:\/\/www.myjobmag.com\/jobs\/accounts-officer-at-wellspring-college","pub_date":"Mon, 23 Jan 2023 16:47:42 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":35,"title":"Online Sales Representative at Yetroselane Couture","description":"Yetroselane is a Fashion hub where we manufacture, and retail womenswear proudly made in Nigeria.\nOur aim is to be a part of every woman&rsquo;s daily life through Fashion, by making them confident and comfortable regardless of their body type, and our designs remain versatile and wearable with the best fit possible.\nWe also recently launched a premium line at the Emerge New York Fashion 2020, this is a haute couture line for our women&rsquo;s special occasion and events.\nYetroselane also diversified into impacting other aspiring fashion entrepreneurs and helping them build a successful fashion brand through her Fashion Academy.\nThe Academy covers training on Pattern drafting, Garment Construction, Fashion Illustration, Designing and lastly the Business of Fashion, which covers various aspects of running a successful fashion brand such as: Pricing, Target Audience, Mentorship program and the list is endless.","link":"https:\/\/www.myjobmag.com\/jobs\/online-sales-representative-at-yetroselane-couture","pub_date":"Mon, 23 Jan 2023 16:25:21 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":36,"title":"English Teacher at Eritoy Schools","description":"Eritoy International Schools was founded on September 16, 2002, as a Christian Nursery and Primary School with the objective of laying a solid foundation for children&rsquo;s life-long learning. To achieve an excellent start we teach using the Montessori Method. As a Christian school with godly principles, our primary goal has always been to raise students who are both academically and spiritually sound. We believe that godliness and education produce successful and honest leaders of tomorrow.","link":"https:\/\/www.myjobmag.com\/jobs\/english-teacher-at-eritoy-schools","pub_date":"Mon, 23 Jan 2023 16:22:30 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":37,"title":"Admin\/Accountant at BlueSky Media Promotions","description":"&quot;BlueSky Media Promotions is a 360-degree media agency providing services ranging from corporate gifts, promotional item, out of home advertising, branding, etc&quot;\n","link":"https:\/\/www.myjobmag.com\/jobs\/admin-accountant-at-bluesky-media-promotions","pub_date":"Mon, 23 Jan 2023 16:20:24 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":38,"title":"Client Service\/Marketing Executive at BlueSky Media Promotions","description":"&quot;BlueSky Media Promotions is a 360-degree media agency providing services ranging from corporate gifts, promotional item, out of home advertising, branding, etc&quot;\n","link":"https:\/\/www.myjobmag.com\/jobs\/client-service-marketing-executive-at-bluesky-media-promotions","pub_date":"Mon, 23 Jan 2023 16:19:28 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":39,"title":"Jobs at AugustSecrets","description":"AugustSecrets is an Award-winning company started by a young woman who had her child, Jaden, outside her country, and on returning, bought all sorts of foods and baby care items for the baby to be weaned at 6 months, but he later rejected the foods. As a first time mother, she got frustrated as the child was starving, and then, this moved her to begin to find alternatives from African and Nigerian foodstuffs to make homemade meals for her son. At first, the child was a picky eater, but in-between the struggle and as the mother enrolled for a short course in nutrition, she was able to come up with naturally-made, nutritious meal ideas that the baby loved. He grew solely on the meals, and the mother began to sell to young mothers like her who needed the same help with their children.\n","link":"https:\/\/www.myjobmag.com\/jobs\/online-sales-representative-at-augustsecrets","pub_date":"Mon, 23 Jan 2023 16:18:49 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":40,"title":"Brand Ambassador at Kirby Nigeria","description":"Keeping the best KIRBY tradition, KYAVALIR appears in 2017, with the mission of implementing values and mechanisms of rigor and dedication. Our company has as its main standard the dedication to its constituents as well as harmony and peace at work.","link":"https:\/\/www.myjobmag.com\/jobs\/brand-ambassador-at-kirby-nigeria","pub_date":"Mon, 23 Jan 2023 16:17:04 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":41,"title":"Accountant at AlisterGreene","description":"Alister Greene Consulting is a professional consulting firm with expertise in providing a People-Process Management solution to Small and Medium Scale Enterprises. Our People-Process solutions cover the very needs of start-ups and growing organizations.","link":"https:\/\/www.myjobmag.com\/jobs\/accountant-at-alistergreene-1","pub_date":"Mon, 23 Jan 2023 16:15:02 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":42,"title":"Fresh Jobs at ARM Hold Co.","description":"ARM Life formerly CrystaLife Assurance Plc. is the insurance subsidiary of Asset &amp; Resource Management Company Ltd (ARM).\n\nIts parent company, ARM is one of the largest non-bank financial services firms in Nigeria with a focus on asset management. Established in 1994, ARM started operations as a traditional asset management company specialising in the management of quoted equities and fixed income securities. However, over the years, the Firm has taken advantage of opportunities in various sectors of the Nigerian economy and has proven its ability to identify and develop new strategic businesses and integrate these to strengthen its asset management business model. This ability has resulted in the evolution of the Firm into a diversified financial services institution with businesses divided into two distinct parts within which various products and bespoke asset management services are offered to our diverse clients, focusing on Traditional Asset Management and Specialised Funds. ARM currently manages total assets of over N500bn.\n\nARM Life has a strong track record in the group life insurance sector with favourable references across the industry. It is licensed and regulated by the National Insurance Commission of Nigeria (NAICOM) to underwrite Life, Annuity and Health insurance.","link":"https:\/\/www.myjobmag.com\/jobs\/fresh-jobs-at-arm-hold-co","pub_date":"Mon, 23 Jan 2023 16:14:37 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":43,"title":"Sales \/ Marketing Executive at Edgewood Consulting Limited","description":"Edgewood consulting is a management consulting and talent development firm registered in Nigeria to provide cutting - edge and value - added advisory, performance improvement, learning improvement, human resources management, restructuring turnaround management and market development research services.","link":"https:\/\/www.myjobmag.com\/jobs\/sales-marketing-executive-at-edgewood-consulting-limited","pub_date":"Mon, 23 Jan 2023 16:13:31 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":44,"title":"Chief Technical Officer at Uniccon Group","description":"Expertise & Experience for best results.\n\nBuilding Africa&rsquo;s economy through innovative technology solutions.","link":"https:\/\/www.myjobmag.com\/jobs\/chief-technical-officer-at-uniccon-group","pub_date":"Mon, 23 Jan 2023 16:12:23 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":45,"title":"Graphic Designer at Construction Kaiser Limited","description":"Construction Kaiser Limited is an indigenous building and civil engineering construction company. We undertake residential, commercial, and industrial engineering construction projects in different geopolitical zones of the country. We currently have a staff strength of about 200, about half of which are direct industry professionals","link":"https:\/\/www.myjobmag.com\/jobs\/graphic-designer-at-construction-kaiser-limited","pub_date":"Mon, 23 Jan 2023 16:12:18 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":46,"title":"Job Opportunities at StreSERT Services Limited","description":"StreSERT is a professional services organisation that offers quality stress-free solutions to corporate organisations. We offer business support and integrated solutions in different areas that ensure business objectives are achieved.\n\nCritically, we evaluate issues as they impact your business, and consequently deploy the appropriate skills and competencies to proffer the needed solutions. \n\nOur Brand Driver\nAt StreSERT, we believe that living by a set of core values help define the true measure of a company; they guide the way we treat each other and how we make business decisions, regardless of time, situation or person. They are the very essence of our company culture; the soul of our company. Ours is about building an organisation that has purpose, focus and alignment, which lives its values every day and creates an environment that allows employees to grow and to produce superior results. \n\nOur Vision:\nTo be the preferred Human Resources and Integrated Enterprise Solutions provider. \n\nOur Mission:\nWe lead in the provision of quality, flexible and result-oriented support solutions that will impact our clients&rsquo; businesses profitably.","link":"https:\/\/www.myjobmag.com\/jobs\/job-opportunities-at-stresert-services-limited-11","pub_date":"Mon, 23 Jan 2023 16:11:15 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":47,"title":"IT Officer at Willers Solutions Limited","description":"We are a fast paced business management solutions firm with an array of value offerings to Corporate organisations. We work in all major sectors of the economy engaging highly trained and sector-experienced Consultants. Willers Solutions Limited is an indigenous firm with cutting edge value proposition geared towards value maximisation.\n\nOur focus is on creating and managing change in organisations by formulating and implementing customer centric strategies. We have acquired capabilities to engage a wide range of assignments essentially to enable clients execute projects, enhance efficiency and to develop human capacity.\nOur mode of delivery connotes our own highly competitive recruitment of quality, zealous and experienced consultants whose expertise we continuously enhance through intensive training in the use of our proprietary management tools and techniques.\n\nOur guiding philosophy is predicated on the premise that what most companies and individuals have in common is either the dissatisfaction with their current results or a drive to transit to another level. Our focus quintessentially is to bridge this gap and create value for our clients as a result of the work we do with them.","link":"https:\/\/www.myjobmag.com\/jobs\/it-officer-at-willers-solutions-limited","pub_date":"Mon, 23 Jan 2023 16:07:48 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":48,"title":"Power Training Consultant at Applied Engineering Technology Initiative","description":"Applied Engineering Technology Initiative Limited (AETI) is an engineering consulting company, whose focus has been on rendering the following services: Technical Training, Recruitment of technical Personnel, Outsourcing of Technical Personnel and rendering engineering consulting services to the Manufacturing, Oil &amp; Gas, Telecommunications, engineering services, Hospitality Industry, etc.\n\nAETI has been established after a thorough research into the technological direction of the present day manufacturing, oil &amp; gas, telecommunication and engineering\/technical services industries in Nigeria and across Africa. Companies keep expanding to meet products\/services demand challenges using new technologies. In achieving this, the aid of automation processes and controls are used to meet high volume production and service demands.\n\nA team of experienced electrical, instrumentation, automation, mechanical and telecommunication engineers and trainers\/facilitators have been carefully selected to run this company which has been established to meet the present day technical capacity development requirements, providing competent manpower personnel, and rendering high tech engineering consulting services to companies in the manufacturing, oil &amp; gas, telecommunication, hospitality and service industries.\n\nOur objective is to bridge the engineering\/technical knowledge deficiency gap between the theoretical skills and knowledge of the graduates of educational system and what the industries require, as well as rendering professional technical recruitment and engineering consulting services to the industries.\n\nThough our technical and management training programs are targeted at the industries, individuals who wish to upgrade their skills and competency for career advancement are welcomed.","link":"https:\/\/www.myjobmag.com\/jobs\/power-training-consultant-at-applied-engineering-technology-initiative","pub_date":"Mon, 23 Jan 2023 16:06:26 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":49,"title":"Procurement and Logistics Officer at Creative Associates International for West","description":"Creative Associates International is a dynamic, fast-growing global development firm that specializes in education, economic growth, democratic institutions and stabilization. Based in Washington, D.C., Creative has a field presence in more than 25 countries with a strong client portfolio that includes the U.S. Agency for International Development and the State Department, among others. Since its founding in 1977, Creative has earned a solid reputation among its clients and is well-regarded by competitors and partners alike.\n","link":"https:\/\/www.myjobmag.com\/jobs\/procurement-and-logistics-officer-at-creative-associates-international-for-west","pub_date":"Mon, 23 Jan 2023 16:03:19 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":50,"title":"Job Vacancies at Ascentech Services Limited","description":"Ascentech Services Ltd acts as a gateway to provide a wide range of recruitment and selection services to companies. We are a dedicated team of professional consultants offering top-of-the-line executive recruitment and selection services. We cater for the needs of a range of professionals seeking employment and work together to create effective solutions using our networks and strong client base.","link":"https:\/\/www.myjobmag.com\/jobs\/job-vacancies-at-ascentech-services-limited-31","pub_date":"Mon, 23 Jan 2023 16:01:31 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":51,"title":"Accountant (ACA) at Skipper Eye-Q Hospital","description":"Skipper Eye-Q Speciality eye hospital is an international eye hospital with chain presence of 42 eye hospitals in India and Nigeria.","link":"https:\/\/www.myjobmag.com\/jobs\/accountant-aca-at-skipper-eye-q-hospital","pub_date":"Mon, 23 Jan 2023 16:01:30 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":52,"title":"IT Technician at Surfspot Communications","description":"Your truly unlimited, reliable and super fast broadband internet service.","link":"https:\/\/www.myjobmag.com\/jobs\/it-technician-at-surfspot-communications-1","pub_date":"Mon, 23 Jan 2023 15:59:43 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":53,"title":"Impex and Logistics Officer at Phillips Outsourcing","description":"LORACHE LIMITED is a marketing management, Human Capital development and Business Process &amp; Strategist consultancy outfit, registered with Company &amp; Allied Commission (CAC) of Nigeria to perform such businesses.\n\nLORACHE deals in sales and marketing consultancy and training organisation working across multiple industries, including the consumer goods, finance, capital market, pharmaceutical, telecommunication, entertainment and leisure sectors etc. We develop integrated sales and marketing strategies focused around the point of purchase. We also devise transformational strategies through organisation design, process definition, and commercial ability development.\nLORACHE provides a range of open and dedicated training programmes that gives insight and help clients develop and maintain the flow of integrated information and commercial insights to gain competitive advantage.","link":"https:\/\/www.myjobmag.com\/jobs\/impex-and-logistics-officer-at-phillips-outsourcing","pub_date":"Mon, 23 Jan 2023 15:59:01 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":54,"title":"Driver at Kest Professional Services","description":"Kest Professional Services Limited - Our client is a fashion outfit with outstanding and unique designs suited to different brands, professional bodies, schools and individuals. For those consumers seeking the latest trendy styles, they will be sure to accommodate the stylish young look you are looking for, not just the latest in fashion trends, but for outfits that adequately represents their unique needs and portray their brand image.","link":"https:\/\/www.myjobmag.com\/jobs\/driver-at-kest-professional-services","pub_date":"Mon, 23 Jan 2023 15:56:38 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":55,"title":"Cleaners at International Facilities Services","description":"IFS is an international facilities management company operating global standards to wide range of clients in Nigeria, Ghana, South Africa and the Middle East.\n\nOur expert staff members with many years of experience in the Facilities Management industry ensure clients facilities needs are fully catered for. The services are intended to provide cost effective and efficient, end to end results every time.\n\nThe organization can supply long lasting facilities solutions that are essential for businesses and offer increased efficiency within the work environment.\n\nWith bespoke solutions, the services include a wide range of soft facilities services from janitorial cleaning, security through to vending and landscaping and hard maintenance services ranging from generators, HVAC to building maintenance services.\n\nThrough our partnership with FSI (FM) UK, Europe&rsquo;s leading facilities management automation provider, IFS service delivery is unique in many respects with the use of the award winning Concept facilities automation systems and application which enables an ongoing process improvement in the delivery of service to our clients.\n\nApart from our international affiliations, we also engage locally with specialist companies in certain areas of our business offerings to ensure our clients always get the best in industry experience. We provide technical supervision to our local partner companies.","link":"https:\/\/www.myjobmag.com\/jobs\/cleaners-at-international-facilities-services","pub_date":"Mon, 23 Jan 2023 15:56:21 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":56,"title":"Finance Intern at EdFin Microfinance Bank","description":"  EdFin Microfinance Bank was birthed out of the need for quality education in Nigeria. The bank which is dedicated solely to funding the education eco-space in Nigeria aims to positively disrupt the standard and quality of education in Nigeria, by providing the much-needed financial resources and services to the education sector. ","link":"https:\/\/www.myjobmag.com\/jobs\/finance-intern-at-edfin-microfinance-bank","pub_date":"Mon, 23 Jan 2023 15:54:17 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":57,"title":"Quantity Surveyor at Amazon Energy Limited","description":"We are a leader in the provision of innovative Integrated Energy Services, primarily to the Power and Oil &amp; Gas sectors.\n\nWe also have strategic interests in downstream trading and shipping.\n","link":"https:\/\/www.myjobmag.com\/jobs\/quantity-surveyor-at-amazon-energy-limited","pub_date":"Mon, 23 Jan 2023 15:52:53 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":58,"title":"Head of Growth and Business Development at EjiCareers","description":"Nairametrics is a leading financial resource company based in Nigeria. We provide our clients (including visitors to our website) with up to date business, investing and financial information from Africa&rsquo;s largest economy. We also have a consulting arm that provides bespoke financial management services to clients","link":"https:\/\/www.myjobmag.com\/jobs\/head-of-growth-and-business-development-at-ejicareers","pub_date":"Mon, 23 Jan 2023 15:51:59 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":59,"title":"Customer Success Representative at LifeBank","description":"LifeBank is a platform that makes blood available when and where it is needed in Nigeria to save lives. We mobilize blood donations, take inventory of all blood available in the country, and deliver blood in the right condition to the point of need.","link":"https:\/\/www.myjobmag.com\/jobs\/customer-success-representative-at-lifebank","pub_date":"Mon, 23 Jan 2023 15:26:25 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":60,"title":"Key Account Sales Executive at Alfred & Victoria Associates","description":"Alfred &amp; Victoria Associates is one of Nigeria&rsquo;s leading ICT solution based company. Our company offers a wide range of services which are in high demand of today&rsquo;s emerging market.","link":"https:\/\/www.myjobmag.com\/jobs\/key-account-sales-executive-at-alfred-victoria-associates","pub_date":"Mon, 23 Jan 2023 15:13:27 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":61,"title":"QRx Sales Associate- Port Harcourt at mPharma","description":"mPharma's mission is to increase patient access to high quality medications. Through our drug benefits service, we offer a number of solutions to health insurance companies and pharmaceutical companies to make it easier for patients to afford their medications.","link":"https:\/\/www.myjobmag.com\/jobs\/qrx-sales-associate-port-harcourt-at-mpharma","pub_date":"Mon, 23 Jan 2023 15:11:17 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":62,"title":"Pharmacist at DEDA Hospital","description":"DEDA Hospital is a leading Nigerian healthcare provision facility with a history of successful health outcomes for our clients. Started Operations in 2012, DEDA hospital is home to an array of experienced healthcare providers and administrators from across the world with a dedication to delivering optimal healthcare service, especially to women, children and families. For over 6 years, DEDA hospital has provided Abuja, Nigeria and the International world with high quality, compassionate healthcare. Today, DEDA Hospital has thousands of patients, numerous staff and healthcare professionals.\n","link":"https:\/\/www.myjobmag.com\/jobs\/pharmacist-at-deda-hospital-2","pub_date":"Mon, 23 Jan 2023 15:09:35 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":63,"title":"Internal Auditor at Genesis Group","description":"Genesis Group is a wholly Nigerian owned Catering, Hospitality &amp; Entertainment Conglomerate with business interest in Hotels, Restaurants, Cinemas, Shopping Malls, Real Estate Development, Outdoor Catering, Industrial Catering &amp; Housekeeping Management, and Food Production.\nFor over 2 decades we have provided 'Exceptional Products &amp; Services&rsquo; to both multinational and Nigerian corporations, as well as discerning members of the public looking for something special.\n \nCore Business Units\nIndustrial Catering &amp; Housekeeping Management: With over 20 years of verifiable experience, working with a diverse range of Clientele, under the most challenging conditions, Genesis continually provides exceptional Catering and Housekeeping Management services to the Nigerian Oil &amp; Gas sector, counting the biggest industry names among our Clients. More &Acirc;&raquo;\n\nGenesis Deluxe Cinemas: A modern and unique cinema brand, delivering the best international and domestic movie release within a modern stat-of-the-art environment, currently operating sites in Lagos, Port Harcourt and Enugu, with many more soon to open. More &Acirc;&raquo;\n\nGenesis Centre: Situated at the heart of GRA in Port Harcourt, Rivers State, the Genesis Centre is the first of a series of ultra-modern state-of-the-art Shopping &amp; Entertainment facilities designed to deliver the most unique and rewarding family shopping and entertainment experience. More &Acirc;&raquo;","link":"https:\/\/www.myjobmag.com\/jobs\/internal-auditor-at-genesis-group","pub_date":"Mon, 23 Jan 2023 15:08:16 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":64,"title":"I.T Personnel at Fadac Resources","description":"Proven methodology, profound impact, and sustainable results.\nThese are the component that makes our company unique. At Fadac Resources we provide businesses with human capital solutions that can help improve oral performance while reducing employment practice risk.\nWe can assist organization no matter how large or small to establish , outsource and trouble shoot any human resources functions\/ challenges .\nOur believe is that people are the greatest asset in the organization regardless of the business size, industry and market share. We provide the best professionals backed with solid years of experience and knowledge, and their job is to integrate solutions for your business needs.","link":"https:\/\/www.myjobmag.com\/jobs\/i-t-personnel-at-fadac-resources","pub_date":"Mon, 23 Jan 2023 15:05:04 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":65,"title":"Commercial Head, Expats at 4 Quarters Consultants Limited","description":"We are widely valued for providing our clients with ISO Consultancy Services. Rendered by diligent professionals, these offered services are appreciated for their time-execution, reliability and authenticity. During the dealings, we assure that all the rules and regulations are followed as per the International norms.","link":"https:\/\/www.myjobmag.com\/jobs\/commercial-head-expats-at-4-quarters-consultants-limited","pub_date":"Mon, 23 Jan 2023 15:03:38 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":66,"title":"Inverter Technician at Simba Group Nigeria Limited","description":"The Simba Group is a conglomerate, operating in Nigeria&rsquo;s key industry verticals including Communications, Agriculture, Software, Transportation, Power and Alternative Energy.\nWe have over 20 years of experience in Nigeria, and in that time have developed loyal and strong distribution channels, across our range of products, as well as a deep understating of the socio-demographic environment which has contributed to our success as a marketing organization.\nWe understand that purchasing our products often represents a large-scale investment on the part of our customers and even our corporate clients. Offering them high quality products and services that meet their expectations requires us to have a deep understating of their needs and a commitment to excellence throughout the organization.\nDistribution and Reach have always been core to our selling strategy, and today represent our key strengths as a customer-centric organization. Operating from eight branches in Nigeria, our products can be found in every corner of the country and are augmented by the same level of service regardless of how far they are from the Head Office.","link":"https:\/\/www.myjobmag.com\/jobs\/inverter-technician-at-simba-group-nigeria-limited","pub_date":"Mon, 23 Jan 2023 15:03:04 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":67,"title":"Job Vacancies at George Houston Resources Limited","description":"George Houston Resources Limited (GHR) assists organizations to achieve their corporate visions and objectives through integrated, strategic and solution-oriented HR consulting services using best-practice methodologies.\n","link":"https:\/\/www.myjobmag.com\/jobs\/job-vacancies-at-george-houston-resources-limited-2","pub_date":"Mon, 23 Jan 2023 15:01:46 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":68,"title":"Sales Consultant at Ives Medicare Limited","description":"Ives Medicare is a managed care organisation registered in Nigeria and accredited by the National Health Insurance Scheme (NHIS) for the purpose of providing health insurance coverage for individuals, organized groups, corporate bodies and government parastatals to access pre-sold, high quality healthcare services from an exclusive networks of clinics, hospitals, pharmacies and diagnostics centres nationwide.\n\nIves Medicare has secured an outstanding position through product innovation, exclusivity of service provides, high standards of service, personalized healthcare, and simplicity of process, our goal is to make a statement&rsquo; cause a movement to take the practice of caregiving to a whole new level and we wish you join our bid to redefine healthcare delivery in Nigeria. Our board members are eminent personalities with expansive knowledge in their various fields of business endeavours.","link":"https:\/\/www.myjobmag.com\/jobs\/sales-consultant-at-ives-medicare-limited","pub_date":"Mon, 23 Jan 2023 15:00:51 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":69,"title":"Senior Finance Manager at the Candel Company","description":"The Candel Company Limited seeks to improve the industry economics and competitiveness of West African crop farmers by developing and distributing innovative seeds, specialized fertilizers and crop protection products that enhance their yields. The company also facilitates market access and financial inclusion for its farmers. Founded 22 years ago with operations in Nigeria and Ghana, Candel has become an acknowledged leader in its industry.\n","link":"https:\/\/www.myjobmag.com\/jobs\/senior-finance-manager-at-the-candel-company","pub_date":"Mon, 23 Jan 2023 15:00:10 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":70,"title":"Senior Finance Manager at PG Consulting Limited","description":"PG Consulting limited is a business optimization consulting firm that leverages the techniques of business research, cutting edge innovation and scientific economics to provide robust insights that enable business decision makers to achieve accelerated and sustained competitive outcomes. We want to work with you as partners on an on-going basis towards making your organisation more profitable and better performing in terms of its bottom-line.","link":"https:\/\/www.myjobmag.com\/jobs\/senior-finance-manager-at-pg-consulting-limited","pub_date":"Mon, 23 Jan 2023 14:56:10 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":71,"title":"Direct Sales Agent at Catilas Resources Limited","description":"Catilas Resources Limited is an outsourcing and advisory services Company. Our focus is to help our clients leverage their core capabilities to optimize market opportunities.","link":"https:\/\/www.myjobmag.com\/jobs\/direct-sales-agent-at-catilas-resources-limited","pub_date":"Mon, 23 Jan 2023 14:55:15 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":72,"title":"Jobs at EPCM Engineers Limited","description":"THE EPCM COMMITTMENT\nFrom the early stages of an engineering project, our experienced engineers provide expertise needed to derive optimal project definitions in a robust application of the conceptual design and selection process. Through iterative utilization of formulation, analysis, cost estimation\/optimization techniques, risk assessments, research, decision analysis, specification and modification, we add value by developing concepts that refine functional requirements within our client&rsquo;s financial constraints, schedule, quality and the international and local Regulatory Compliance framework. Because the greatest opportunity to control project costs and risk lie in the quality of work at the concept selection and definition stage, we ensure that our clients get the best of services that often yield substantial cost savings without compromising on quality and content.\n\nWe recognize that although every project is unique in terms of complexity, challenge, size, budget, location and specific objectives, all projects have common set objective: \"Design, Procure, construct and operate in the most efficient manner, low cost within budget and schedule and operate without hurting people, the environment or infrastructure&rdquo;.\n\nOur Project management system has developed a process that effectively manages the historic inertia and divisions among planners, designers and construction teams to implement successful projects. Our Project Engineering and management system adequately integrates the intrinsic critical success factors to achieve project success within the definitions of Time, Human Resources, Cost, Quality, risk and Regulatory environment.\n\nOur commitment and promise is to do all it takes, to exceed our customer expectation, each time, every time!!","link":"https:\/\/www.myjobmag.com\/jobs\/jobs-at-epcm-engineers-limited-1","pub_date":"Mon, 23 Jan 2023 14:54:27 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":73,"title":"Job Openings at Trispay Financials","description":"Trispay Financials is an SME based financial organisation centred around providing financial support to businesses to help them scale up growth and improve the economy.","link":"https:\/\/www.myjobmag.com\/jobs\/credit-officer-at-trispay-financials","pub_date":"Mon, 23 Jan 2023 14:52:51 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":74,"title":"Fresh Jobs at NewGlobe","description":"NewGlobe supports visionary governments to transform public education systems, the cornerstone of a prosperous, equitable, and peaceful society. With a comprehensive system transformation platform and data-driven educational services,","link":"https:\/\/www.myjobmag.com\/jobs\/programme-manager-schools-at-newglobe","pub_date":"Mon, 23 Jan 2023 14:35:10 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null},{"id":75,"title":"Financial Controller [Remote] at Lori Nigeria","description":"Lori is a venture-backed, rapidly growing start-up that has built a cutting-edge, tech-driven, logistics services platform that seamlessly coordinates haulage across frontier markets. With a mission to reduce the cost of goods in frontier markets, Lori is tackling a massive issue; $180 billion is spent annually on haulage across Africa, and up to 75% of a product&rsquo;s cost is due to logistics (compared to 6% in the US).\n\nLori was recognized as the fastest growing start-up in Africa and won Techcrunch&rsquo;s Battlefield Africa. Our tech-enabled and operations-driven marketplace efficiently connects transport to cargo. The system brings transparency to the logistics industry and has significantly improved flexibility, reliability, and cost savings (upwards of 20%). Billions of dollars of cargo move through the Lori platform annually.","link":"https:\/\/www.myjobmag.com\/jobs\/financial-controller-remote-at-lori-nigeria","pub_date":"Mon, 23 Jan 2023 14:31:26 GMT","is_publish":1,"created_at":"2023-01-23T21:59:36.000000Z","updated_at":"2023-01-23T21:59:36.000000Z","deleted_at":null}]